def user_menu() -> None:
    """
    Пользовательское меню
    :return: None
    """
    print('')
    print('1: Список всех компаний и количество вакансий у каждой компании')
    print('2: Список всех вакансий с указанием названия компании, названия вакансии и зарплаты и ссылки на вакансию')
    print('3: Средняя зарплата по вакансиям')
    print('4: Список всех вакансий, у которых зарплата выше средней по всем вакансиям')
    print('5: Список всех вакансий, в названии которых содержатся переданные в метод слова')
    print('0: Выход')
    print('')
